package DayByDay._0404;
/**
 * @문제번호 : Q16939
 * @문제이름 : 2*2*2큐브
 * @난이도 : Gold II
 * @date : 2022-04-04 오후 3:40
 * @author : pcrmcw0486
 * @문제이해
 * 큐브 각 면 색상 모두 같으면 큐브를 풀었다.
 * 한번 돌려서 큐브를 풀 수 있을까?
 * 큐브 각 면의 각 칸 색상이 주어지고, 1~6까지 자연수로 나온다.
 * i번째 수는 다음과 같다.
 *        1 2
 *        3 4
 * 13 14  5 6  17 18 21 22
 * 15 16  7 8  19 20 23 24
 *        9 10
 *       11 12
 * 돌릴 수 있는 방향은 총 12개. 3* 2* 2 (x,y,z축 * 시계반시계 * 왼쪽 오른쪽)
 *  @알고리즘
 * @접근방법

*/
public class Q16939 {
    public static void main(String[] args) {
        //TODO
    }
}
